<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 2.0//EN">
<!--Converted with LaTeX2HTML 96.1-h (September 30, 1996) by Nikos Drakos (nikos@cbl.leeds.ac.uk), CBLU, University of Leeds -->
<HTML>
<HEAD>
<TITLE>R&#201;SUM&#201;</TITLE>
<META NAME="description" CONTENT="R&#201;SUM&#201;">
<META NAME="keywords" CONTENT="foe">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
<LINK REL=STYLESHEET HREF="foe.css">
</HEAD>
<BODY LANG="EN" >
 <A NAME="tex2html120" HREF="node3.html"><IMG WIDTH=37 HEIGHT=24 ALIGN=BOTTOM ALT="next" SRC="icons/next_motif.gif"></A> <A NAME="tex2html118" HREF="foe.html"><IMG WIDTH=26 HEIGHT=24 ALIGN=BOTTOM ALT="up" SRC="icons/up_motif.gif"></A> <A NAME="tex2html112" HREF="node1.html"><IMG WIDTH=63 HEIGHT=24 ALIGN=BOTTOM ALT="previous" SRC="icons/previous_motif.gif"></A> <A NAME="tex2html122" HREF="node4.html"><IMG WIDTH=65 HEIGHT=24 ALIGN=BOTTOM ALT="contents" SRC="icons/contents_motif.gif"></A>  <BR>
<B> Next:</B> <A NAME="tex2html121" HREF="node3.html">ACKNOWLEDGEMENTS</A>
<B>Up:</B> <A NAME="tex2html119" HREF="foe.html">Mobile Robot Localisation Using </A>
<B> Previous:</B> <A NAME="tex2html113" HREF="node1.html">ABSTRACT</A>
<BR> <P>
<H1><A NAME="SECTION00200000000000000000">R&#201;SUM&#201;</A></H1>
<P>
Nous pr&#233;sentons ici une approche au probl&#232;me de la localisation
d'un robot autonome utilisant la vision informatique.  Il s'agit
d'obtenir une estimation pr&#233;cise de la position du robot dans un
environnement explor&#233; au pr&#233;alable, ceci m&#234;me sans une
estimation connue <em>a priori</em>.  Notre approche prend avantage &#224;
la fois de m&#233;thodes qui reposent sur l'interpr&#233;tation des
donn&#233;es ainsi que de m&#233;thodes statistiques plus g&#233;n&#233;rales.
<P>
Ceci est r&#233;alis&#233; en entrainant le robot a reconna&#238;tre &#224;
partir d'une serie d'images un ensemble d'&#233;l&#233;ments visuels
appel&#233;s <em>points de rep&#232;re</em>, chacun d'entre eux &#233;tant
d&#233;fini comme &#233;tant un point extr&#234;me d'une fonction mesurant le
caract&#232;re unique d'une portion de l'image en question. Ces points de
rep&#232;res sont ensuite enregistr&#233; dans une base de donn&#233;es, ceci
avec l'information visuelle n&#233;cessaire afin de les distinguer les
uns des autres.
<P>
La localisation est accomplie en associant chaque point de rep&#232;re
<em>observ&#233;</em> avec un point de rep&#232;re qui se trouve d&#233;j&#224; dans
la base de donn&#233;es en question; ceci produit une estimation de la
position du robot pour chaque point de rep&#232;re observ&#233;. Ces
differentes positions sont ensuite combin&#233;es afin d'obtenir une
estimation de la position finale ainsi que l'incertitude associ&#233;e
avec cette position en question.
<P>
L'exp&#233;rience d&#233;montre qu'il est possible d'estimer la position du
robot avec une r&#233;solution sup&#233;rieure &#224; la densit&#233;
d'&#233;chantillonnage.  Ce r&#233;sultat est &#233;galement maintenu si l'on
modifie les param&#232;tres de la m&#233;thode de localisation, ou encore si
l'on modifie la densit&#233; d'&#233;chantillonnage.
<P>
<BR> <HR>
<P><ADDRESS>
<I>Robert Sim <BR>
Tue Jul 21 10:30:54 EDT 1998</I>
</ADDRESS>
</BODY>
</HTML>
